# Задание №1 - сделано
# Задание №2 - сделано
# Задание №3:
# import this - после запуска выдает Дзен Пайтона
# import antigravity - после запуска перекидывает на страницу браузера https://xkcd.com/353/ с комиксом
# import __hello__ - после запуска выдает 'Hello world!'
# from __future__ import braces - после запуска выдает ошибку 'SyntaxError: from __future__ imports must occur at the beginning of the file',
# перенес в начало, выдает ошибку 'SyntaxError: not a chance', погуглил - скобок в Пайтоне не будет никогда.
# Задание №4:
# Вариант №1 (вручную):
print('''
                                         * *
                                          *

  ***   *****   ****    *****   *****   *   *
 *      *       *   *   *       *       *  **
*       *       *   *   *       *       *  **
*       *****   ****    *       *****   * * *
*       *       *       *       *       * * *
 *      *       *       *       *       **  *
  ***   *****   *       *       *****   *   *
''')
# Вариант №2 (модулем art) / ('звёздочками' не понял как сделать через модуль art):
from art import *
tprint('SERHII')
# Задание №5:
x = int(input('x='))
y = int(input('y='))
print(x, y) # вывод двух чисел используя только один вызов print()
print(x+y) # вывод суммы чисел
print(x//y) # вывод целочисленного деление
print(x%y) # вывод остатка
print(x**y) # вывод степени
# Задание №6 - сделано
